{
    "chain": [
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1072,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 69,
                "ปีการศึกษา": 2020,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 138.5,
                "เกรดพ้อยสูงสุด": 155.5
            },
            "hash": "d57e44785302482e7cf8ab105a9282235322e188c72729a734ee6a3af251eae8",
            "index": 1,
            "nonce": 1,
            "previous_hash": "0",
            "timestamp": "2024-01-24 19:29:20.816491"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1220,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 71,
                "ปีการศึกษา": 2021,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 140.2,
                "เกรดพ้อยสูงสุด": 160.6
            },
            "hash": "eb1de743b163dcce2b90544f321a8b4bf3f4b9fa0bc9b99df3777c07a9686af4",
            "index": 2,
            "nonce": 533,
            "previous_hash": "d57e44785302482e7cf8ab105a9282235322e188c72729a734ee6a3af251eae8",
            "timestamp": "2024-01-24 19:29:28.085100"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1357,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 73,
                "ปีการศึกษา": 2022,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 143.5,
                "เกรดพ้อยสูงสุด": 163.0
            },
            "hash": "3fc1573b87539f11a786f5ef1f993c67040b43fe8339b31afb63a849d1c5da09",
            "index": 3,
            "nonce": 45293,
            "previous_hash": "eb1de743b163dcce2b90544f321a8b4bf3f4b9fa0bc9b99df3777c07a9686af4",
            "timestamp": "2024-01-24 19:29:28.880098"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1498,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 77,
                "ปีการศึกษา": 2023,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 151.7,
                "เกรดพ้อยสูงสุด": 166.9
            },
            "hash": "c7bcbd67f92f85b7a642bbbd379730c3bebf0ba001d437d6fa67b1952846de8d",
            "index": 4,
            "nonce": 21391,
            "previous_hash": "3fc1573b87539f11a786f5ef1f993c67040b43fe8339b31afb63a849d1c5da09",
            "timestamp": "2024-01-24 19:29:29.860937"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1586,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 78,
                "ปีการศึกษา": 2024,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 160.2,
                "เกรดพ้อยสูงสุด": 172.6
            },
            "hash": "9bb90d5860f638472b3b92cfe0e648cfb947c83f2b35db41c98b92af0408e48e",
            "index": 5,
            "nonce": 8018,
            "previous_hash": "c7bcbd67f92f85b7a642bbbd379730c3bebf0ba001d437d6fa67b1952846de8d",
            "timestamp": "2024-01-24 19:29:30.612238"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1706,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 84,
                "ปีการศึกษา": 2025,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 161.7,
                "เกรดพ้อยสูงสุด": 178.9
            },
            "hash": "17c0f53560a30e31049d8c9d2f7df26c2d398d0540f09c3f70f4a3888d1f44c9",
            "index": 6,
            "nonce": 48191,
            "previous_hash": "9bb90d5860f638472b3b92cfe0e648cfb947c83f2b35db41c98b92af0408e48e",
            "timestamp": "2024-01-24 19:29:31.303913"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1780,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 87,
                "ปีการศึกษา": 2026,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 168.3,
                "เกรดพ้อยสูงสุด": 181.6
            },
            "hash": "e98342fb1422c8b8c19c2ab3d7a398e03e3dc7e4c79c1645342e638239ff60bb",
            "index": 7,
            "nonce": 19865,
            "previous_hash": "17c0f53560a30e31049d8c9d2f7df26c2d398d0540f09c3f70f4a3888d1f44c9",
            "timestamp": "2024-01-24 19:29:31.789466"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1904,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 88,
                "ปีการศึกษา": 2027,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 173.1,
                "เกรดพ้อยสูงสุด": 182.1
            },
            "hash": "a3a4dadcd61e80df78c4018a388540d87e822313d4c2fed17fc9cbd43dc32ebf",
            "index": 8,
            "nonce": 95063,
            "previous_hash": "e98342fb1422c8b8c19c2ab3d7a398e03e3dc7e4c79c1645342e638239ff60bb",
            "timestamp": "2024-01-24 19:29:32.649201"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 1965,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 93,
                "ปีการศึกษา": 2028,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 181.3,
                "เกรดพ้อยสูงสุด": 183.3
            },
            "hash": "dfd750bddfd497e035b37e581b2863fad1011c8294430690263b7930863ea6fe",
            "index": 9,
            "nonce": 15457,
            "previous_hash": "a3a4dadcd61e80df78c4018a388540d87e822313d4c2fed17fc9cbd43dc32ebf",
            "timestamp": "2024-01-24 19:29:33.138228"
        },
        {
            "data": {
                "จำนวนนักศึกษา(ทั้งหมด)": 2035,
                "จำนวนนักศึกษา(ผ่านการคัดเลือกเข้าวิศวะคอม)": 101,
                "ปีการศึกษา": 2029,
                "สาขาวิชา": "วิศวกรรมคอมพิวเตอร์",
                "เกรดพ้อยต่ำสุด": 190.0,
                "เกรดพ้อยสูงสุด": 190.0
            },
            "hash": "290dbe36d63df53d43a116b18de25642482ef9861fad64bcbc7100b4bf701a1d",
            "index": 10,
            "nonce": 15479,
            "previous_hash": "dfd750bddfd497e035b37e581b2863fad1011c8294430690263b7930863ea6fe",
            "timestamp": "2024-01-24 19:29:33.811917"
        }
    ],
    "length": 10
}